# SQL Formatter
adpyke.vscode-sql-formatter

# Django support
batisteo.vscode-django

# Office files integration (view and edit MS Office documents)
cweijan.vscode-office

# Python extension pack (includes several useful Python extensions)
donjayamanne.python-extension-pack

# GitLens (enhanced Git capabilities)
eamodio.gitlens

# Log file highlighter
emilast.logfilehighlighter

# Prettier code formatter
esbenp.prettier-vscode

# Racket language support
evzen-wybitul.magic-racket

# Shell script formatter
foxundermoon.shell-format

# C/C++ runner and debugger
franneck94.c-cpp-runner

# GitHub Copilot (AI-powered code completion)
github.copilot

# GitHub Copilot Chat (chat-based interface for Copilot)
github.copilot-chat

# GitHub Actions support
github.vscode-github-actions

# Terraform support
hashicorp.terraform

# ANSI color code support
iliazeus.vscode-ansi

# LaTeX Workshop (comprehensive LaTeX support)
james-yu.latex-workshop

# Haskell language support
justusadam.language-haskell

# Additional LaTeX support
mathematic.vscode-latex

# Docker support in VS Code
ms-azuretools.vscode-docker

# Black formatter for Python
ms-python.black-formatter

# Python debugging support
ms-python.debugpy

# Flake8 linter for Python
ms-python.flake8

# isort (Python import sorter)
ms-python.isort

# MyPy type checker for Python
ms-python.mypy-type-checker

# Pylint (Python linter)
ms-python.pylint

# Core Python extension for VS Code
ms-python.python

# Pylance (advanced language support for Python)
ms-python.vscode-pylance

# Jupyter notebook support
ms-toolsai.jupyter

# Jupyter notebook keymaps
ms-toolsai.jupyter-keymap

# Jupyter notebook renderers
ms-toolsai.jupyter-renderers

# Jupyter cell tags
ms-toolsai.vscode-jupyter-cell-tags

# Jupyter notebook slideshow support
ms-toolsai.vscode-jupyter-slideshow

# Development inside Docker containers
ms-vscode-remote.remote-containers

# Remote SSH support for developing on remote servers
ms-vscode-remote.remote-ssh

# Edit files on remote servers via SSH
ms-vscode-remote.remote-ssh-edit

# CMake support in VS Code
ms-vscode.cmake-tools

# Core C/C++ support in VS Code
ms-vscode.cpptools

# C/C++ extension pack
ms-vscode.cpptools-extension-pack

# C/C++ themes for VS Code
ms-vscode.cpptools-themes

# Makefile tools for VS Code
ms-vscode.makefile-tools

# Remote development explorer
ms-vscode.remote-explorer

# Visual Studio Live Share (collaborative editing)
ms-vsliveshare.vsliveshare

# SFTP support
natizyskunk.sftp

# Scheme code formatter
oliver-ni.scheme-fmt

# Colorful comments in code
parthr2031.colorful-comments

# Excalidraw integration (for creating diagrams)
pomdtr.excalidraw-editor

# C++ power tools
powertech.powercpp

# YAML support and validation
redhat.vscode-yaml

# R language support
reditorsupport.r

# Manim (math animation library) support
rickaym.manim-sideview

# Darcula theme for VS Code
rokoroku.vscode-theme-darcula

# Scheme language support
sjhuangx.vscode-scheme

# Git blame annotations in code
solomonkinard.git-blame

# TOML language support
tamasfe.even-better-toml

# CMake support in VS Code
twxs.cmake

# LLDB debugger support
vadimcn.vscode-lldb

# Jinja template support
wholroyd.jinja

# Markdown support and enhancements
yzhang.markdown-all-in-one

# JSON language support
zainchen.json
